eps = float(input('Ввод eps: '))
x = float(input('Ввод x: '))
step = int(input('Ввод шага: '))
n = int(input('Кол-во итераций: '))
from math import factorial
sum = 1
t = x * 2
i = 1

print('\t', '\u250c', '\u2500' * 15, '\u252c', '\u2500' * 31, '\u252c', '\u2500' * 31,
      '\u2510', sep = '')
print('\t', '{:s}{:^13s}{:s}{:^26s}{:s}{:^27s}{:s}'.format('\u2502', 'N',
      '\u2502', 'текущий член ряда', '\u2502', 'текущее значение суммы', '\u2502', ),
      sep = '')
print('\t', '\u251c', '\u2500' * 15, '\u253c', '\u2500' * 31, '\u253c',
              '\u2500' * 31, '\u2524', sep = '')
print('\t', '{:s}{:^13d}{:s}{:^26.7f}{:s}{:^27.5f}{:s}'.format('\u2502', i,
              '\u2502', i, '\u2502', sum, '\u2502'), '\n', sep = '', end = '')

while abs(t) > eps:
    sum += t
    if i % step == 0:
        if len(str(t)) > 20:
            print('\t', '\u251c', '\u2500' * 15, '\u253c', '\u2500' * 31, '\u253c',
               '\u2500' * 31, '\u2524', sep = '')
            print('\t', '{:s}{:^13d}{:s}{:^26e}{:s}{:^27.7f}{:s}'.format('\u2502', i + 1,
               '\u2502', t, '\u2502', sum, '\u2502'), '\n', sep = '', end = '')
        else:
            print('\t', '\u251c', '\u2500' * 15, '\u253c', '\u2500' * 31, '\u253c',
                  '\u2500' * 31, '\u2524', sep='')
            print('\t', '{:s}{:^13d}{:s}{:^26.7f}{:s}{:^27.7f}{:s}'.format('\u2502', i + 1,
                  '\u2502', t, '\u2502', sum, '\u2502'), '\n', sep='', end='')
    w = x / (i + 1)
    t *= w
    i += 1
    if i > n:
        break

if abs(t) <= eps:
    print('\t', '\u251c', '\u2500' * 15, '\u253c', '\u2500' * 31, '\u253c',
          '\u2500' * 31, '\u2524', sep='')
    print('\t', '{:s}{:^13d}{:s}{:^26.7f}{:s}{:^27.7f}{:s}'.format('\u2502', i + 1,
          '\u2502', t, '\u2502', sum + t, '\u2502'), '\n', sep='', end='')
    print('\t', '\u2514', '\u2500' * 15, '\u2534', \
          '\u2500' * 31, '\u2534', '\u2500' * 31, '\u2518', sep = '')
    print('Ряд сошелся на ', i + 1, '-ом', ' элементе', sep = '')
    print()
    print('Сумма элементов: ', '{:f}'.format(sum + t))

else:
    print('\t', '\u2514', '\u2500' * 15, '\u2534', \
          '\u2500' * 31, '\u2534', '\u2500' * 31, '\u2518', sep='')
    print('Ряд не сходится за ', n, ' итераций')